---
kind: type
id: T:Autodesk.Revit.DB.RenderNodeAction
source: html/39f98799-628b-8d65-765c-ca86949ce7ed.htm
---
# Autodesk.Revit.DB.RenderNodeAction

Enumerated actions for processing a render node during custom export.

## Syntax (C#)
```csharp
public enum RenderNodeAction
```